#include <iostream>
using namespace std;

int main() {
    int a = 23985;
    int b = 12409;
    cout << "a : " << bitset<32>(a) << "\n";
    cout << "b : " << bitset<32>(b) << "\n";
    cout << "& : " << bitset<32>(a&b) << "\n";
    cout << "| : " << bitset<32>(a|b) << "\n";
    cout << "^ : " << bitset<32>(a^b) << "\n";
    cout << "~ : " << bitset<32>(~a) << "\n"; // ~는 단항 연산자
    cout << "<<: " << bitset<32>(a<<5) << "\n"; // b의 값이 너무 커서 현재 담겨있는 비트를 다 밀어서 지워버리기 때문에 작은 상수 5 사용
    cout << ">>: " << bitset<32>(a>>5) << "\n"; // b의 값이 너무 커서 현재 담겨있는 비트를 다 밀어서 지워버리기 때문에 작은 상수 5 사용
}
// 출력결과
// a : 00000000000000000101110110110001
// b : 00000000000000000011000001111001
// & : 00000000000000000001000000110001
// | : 00000000000000000111110111111001
// ^ : 00000000000000000110110111001000
// ~ : 11111111111111111010001001001110
// <<: 00000000000010111011011000100000
// >>: 00000000000000000000001011101101